#Вам надо написать на питоне 6 программ, каждая из которых будет спрашивать у пользователя 3 числа (a, b, c) и печатать на экран удовлетворяют ли введенные числа перечисленным свойствам:
#1. A и B в сумме дают C

#2. A умножить на B равно C

#3. a даёт остаток c при делении на b

#4. c является решением уравнения a*x + b = 0

#5. a разделить на b равно c

#6. a в степени b равно c

#Дополнительная задача:
#С начала суток прошло N секунд (N - целое, вводится с клавиатуры). Найти количество часов, минут и секунд на электронных часах.

