#Задача 1: 
#Пользователь вводит свое имя и возраст. Если возраст пользователя больше 18, то вывести строку "Добрый вечер, name! Вы совершеннолетний, поздравляем!", иначе вывести строку "Привет, name! Приносим извинения, но вы не можете гулять после 22:00".

#Задача 2: 
#Пользователь вводит строку - название времени года. Если введенная строка - это лето, то выведите строку "Тополинный пух, жара, июль", если зима, то "Снеговик, снежки и горка", если осень, то "Пора в школу!", если весна, то "Весенняя капель". В случае, если введенная строка не равна ни одному из предложенных вариантов, программа должна выводить строку "Ошибка".

#Задача 3:
#Пользователь вводит текущее время в часах. Если количество часов находится в диапазоне от 0 до 7, то программа выводит строку "Ночь". Если часовая стрелка находится между 7 и 11, то выведется строка "Утро". От 12 до 17 выведется строка "День". Если текущее время находится между 17 и 23, то программа должна вывести строку "Вечер". В случае, когда введенное число отрицательно или больше 23, программа должна вывести строку "Ошибка".

#Дополнительная задача: 
#Даны две шахматные клетки. Они определены четырьмя координатами x1, y1, x2, y2. Выведите YES, если клеткиимеют одинаковый цвет, и NO, если разный.
