#Задача 1: 
#Ребята в детском саду учат числа, и мы можем им в этом помочь. Ребята дают нам два числа — начало и конец последовательности чисел. Наша задача вывести все числа от начала до конца, заполнив промежуток между ними с помощью цикла while

#Задача 2: 
#Продолжаем помогать ребятам в изучении чисел! Они дают нам положительное число N. Найдите сумму всех четных чисел от 0 до N с помощью цикла while.

#Задача 3:
#Дано положительное число N. Найти факториал числа N. Факториалом числа называется произведение всех чисел от 1 до N. Например, факториал числа 5 равен 5! = 1*2*3*4*5 = 120, 2! = 1*2 = 2, 9! = 1*2*3*4*5*6*7*8*9 = 362880

#Дополнительная задача: 
#Дано целое число N (> 0). Найти двойной факториал 
#N: N!! = N * (N-2) * (N-4)* 

