#Задача 1:
#В далекой сказочной стране жил старый мудрец по имени Мерлин. Он знал много тайн и загадок. Однажды, герой по имени Виктор пришел к Мерлину, чтобы разгадать его загадку. Мерлин загадал ему число N, и сказал, что это число может быть простым или нет. Виктор решил использовать магический цикл for, чтобы разгадать загадку Мерлина. Он написал программу, которая с помощью цикла for определит, является ли число N простым или нет. По мере того, как Виктор проходил через цикл, он узнал, что число N - это простое число!

#Задача 2:
#На глубине леса жил древний волшебник по имени Гендальф. Он хранил множество магических знаний. Герой по имени Николай услышал о тайной последовательности чисел, которая хранилась в доме волшебника. Николай решил отправиться на поиски этой тайной последовательности. С помощью мудрости Гендальфа, он научился использовать магический цикл for, чтобы вывести первые N чисел из тайной последовательности Фибоначчи. Николай написал программу, и на странице появилась тайная последовательность: 0, 1, 1, 2, 3, 5, 8, ...

#Задача 3:
#Дано положительное число N. Найти факториал числа N. Факториалом числа называется произведение всех чисел от 1 до N. Например, факториал числа 5 равен 5! = 1*2*3*4*5 = 120, 2! = 1*2 = 2, 9! = 1*2*3*4*5*6*7*8*9 = 362880

#Дополнительная задача:
#Дано целое число N (> 0). Найти двойной факториал N: N!! = N * (N-2) * (N-4)*
