#Попросите пользователя ввести температуру в градусах Цельсия. Переведите эту температуру в градусы Фаренгейта, используя формулу (°F = °C × 9/5 + 32). Выведите результат

#Создать программу-калькулятор для расчета чаевых в ресторане. Программа должна запрашивать у пользователя сумму счета за обед и вычислять 15% от этой суммы в качестве чаевых.

#Даны две целочисленные переменные a и b. Поменяйте их значения местами с помощью третьей переменной

#Дополнительная задача:
#Даны две целочисленные переменные a и b. Поменяйте их значения местами без дополнительных переменных
